app/views/questions/index.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."display" = ?  [["display", "t"]]
---

<h1>Questions</h1>
<br>
<strong id="new_question"><%= link_to 'New Question', new_question_path %></strong><br><br>
<br>
<br>
<% if user_signed_in? %>
<table id="not_approved_question" class="table table-bordered table-striped">
  <h3>Awaiting Approving Questions: </h3>
  <tr>
    <th>Question</th>
    <th>Action</th>
  </tr>
  <tbody>
    <% i=0 %>
    <% @questions.each do |question| %>
    <%   if question.display == true %>
    <%     next %>
    <%   end %>
      <tr>
        <td width="80%"><strong><%= i %>.) Content:<%= question.content %></strong><br>