app/controllers/questions_controller.rb

  def index
    # @questions = Question.all
    @user_id = current_user.id
    # puts("user_id")
    # puts(@user_id)
    # @questions = Question.find{|question| question.uid == @user_id || question.uid == nil}
    if current_user.admin?
      @questions = Question.all
---
SELECT "questions".* FROM "questions" WHERE "questions"."uid" = ?  [["uid", 2]]

    end

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("content", "option1", "option2", "option3", "option4", "answer", "qtype", "explanation", "image", "topic", "display", "uid") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if params[:question][:feedback] != nil
      params[:question][:feedback] = params[:question][:feedback]
    end
    if params[:question][:display] == "Yes"
      params[:question][:display] = true
    else
      params[:question][:display] = false
    end
    if params[:question][:remove_question_image] == "1"
      @question.remove_image = true
      if params[:question][:topic] != nil
        params[:question][:topic] = params[:question][:topic]
      end
      if params[:question][:qtype] == "True or False"
        params[:question][:option1] = 'True'
        params[:question][:option2] = 'False'
        params[:question][:option3] = 'nil'
        params[:question][:option4] = 'nil'
      end
      @question.update(question_params)
---
UPDATE "questions" SET "topic" = ?, "option4" = ?, "display" = ?, "feedback" = ? WHERE "questions"."id" = ?  [["topic", "General"], ["option4", "Both optimal substructure and overlapping subproblems"], ["display", "f"], ["feedback", ""], ["id", 9]]