app/controllers/test_questions_controller.rb

  def index
    @show_resume = false
    # @questions = Question.all
    @questions = Question.where(display: [true, nil])
    @OK = params[:ok]
    @correctness = Hash[@questions.map {|question| [question.id, ""]}]
---
SELECT "questions".* FROM "questions" WHERE ("questions"."display" = 't' OR "questions"."display" IS NULL)
SELECT "questions".* FROM "questions"

    if params[:answers] != nil
      params[:answers].each do |id, answer|
        id = id.to_i
        question = Question.find_by(:id => id)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def resume
    rec = Testrecs.find_by(userid: current_user.id)
    @mark1=rec.mark
    @corr1=rec.correctness
    @ans1=rec.answers
    @top1=rec.seltopics
    @alltop1=rec.alltopics
    rec.destroy
---
SELECT  "testrecs".* FROM "testrecs" WHERE "testrecs"."userid" = ? LIMIT ?  [["userid", 1], ["LIMIT", 1]]
DELETE FROM "testrecs" WHERE "testrecs"."id" = ?  [["id", 1]]

  def signoutwpause
    @mark=params[:mark]
    @correctness=params[:correctness]
    @answers=params[:answers]
    @topics=params[:selected_topics]
    @alltop=params[:all_topics]
    #@user_id=session[:user_id]#current_user.email
    @user_id=current_user.id

    puts params[:selected_topics]
    puts
    rec = Testrecs.new(userid: @user_id , mark: @mark, correctness: @correctness, alltopics: @alltop, answers: @answers, seltopics: @topics)
    rec.save
---
INSERT INTO "testrecs" ("userid", "correctness", "answers", "mark", "seltopics") VALUES (?, ?, ?, ?, ?)