app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
      @loggedin_user=current_user.name
      @users = User.all